src/Catalogs/НеотправленныеСообщенияСистемыВзаимодействия/НеотправленныеСообщенияСистемыВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НеотправленныеСообщенияСистемыВзаимодействия</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбсуждениеИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбсуждениеКонтекст</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Системный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НеотправленныеСообщенияСистемыВзаимодействия/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура УдалитьНеотправленныеСообщения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НеотправленныеСообщенияСистемыВзаимодействия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НеотправленныеСообщенияСистемыВзаимодействия КАК НеотправленныеСообщенияСистемыВзаимодействия";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Сообщение Из Результат Цикл
		СообщениеОбъект = Сообщение.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьНеотправленныеСообщенияПоОбъекту(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НеотправленныеСообщенияСистемыВзаимодействия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НеотправленныеСообщенияСистемыВзаимодействия КАК НеотправленныеСообщенияСистемыВзаимодействия
	|ГДЕ
	|	НеотправленныеСообщенияСистемыВзаимодействия.ОбсуждениеКонтекст = &ОбсуждениеКонтекст";
	Запрос.УстановитьПараметр("ОбсуждениеКонтекст", Ссылка);
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти
